export function sum(arr) {
    let sum = 0;
    for (let num of arr){
        sum += Number(num);
    }
    return sum;
}

// Тази функция проверява дали даден масив е симетричен или не. Симетричен масив е такъв, който е еднакъв с обратния си ред. Например, [1, 2, 3, 2, 1] е симетричен масив, но [1, 2, 3, 4, 5] не е.
// Функцията работи по следния начин:
// Първо, проверява дали аргументът arr е масив, използвайки вградената функция Array.isArray. Ако не е, връща false, защото само масиви могат да бъдат симетрични.
// След това, прави копие на масива arr и го обръща, използвайки методите slice и reverse. Това се прави, за да не се промени оригиналния масив.
// Накрая, сравнява дали масивът arr и неговото обратно копие са еднакви, използвайки функцията JSON.stringify, която преобразува масивите в низове. Ако са еднакви, връща true, ако не - false.

